In [80]:
import pandas as pd
import numpy as np

Series

In [81]:
s1=pd.Series([34,67,90,34,12,67])
s1

0    34
1    67
2    90
3    34
4    12
5    67
dtype: int64

In [82]:
print(s1[0])

34

In [83]:
print(s1[0:3])

0    34
1    67
2    90
dtype: int64

In [84]:
print(s1[0::2])

0    34
2    90
4    12
dtype: int64

Data frame :

In [85]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [86]:
df=pd.DataFrame({
    "Name" : ["vansh","abhay","dhruvi"],
    "Age" : [20,18,22],
    "Marks" : [80,98,94]
})

In [87]:
df

     Name  Age  Marks
0   vansh   20     80
1   abhay   18     98
2  dhruvi   22     94

In [88]:
df["Name"]

0     vansh
1     abhay
2    dhruvi
Name: Name, dtype: object

In [89]:
df[["Name","Marks"]]

     Name  Marks
0   vansh     80
1   abhay     98
2  dhruvi     94

In [90]:
df["Marks"]

0    80
1    98
2    94
Name: Marks, dtype: int64

In [91]:
df["Name"][0]

'vansh'

In [92]:
df

     Name  Age  Marks
0   vansh   20     80
1   abhay   18     98
2  dhruvi   22     94

In [93]:
df["city"]=["delhi","mumbai","pune"]
df

     Name  Age  Marks    city
0   vansh   20     80   delhi
1   abhay   18     98  mumbai
2  dhruvi   22     94    pune

In [94]:
df["city"]=["surat","baroda","amreli"]
df

     Name  Age  Marks    city
0   vansh   20     80   surat
1   abhay   18     98  baroda
2  dhruvi   22     94  amreli

In [95]:
print(df)

     Name  Age  Marks    city
0   vansh   20     80   surat
1   abhay   18     98  baroda
2  dhruvi   22     94  amreli

In [96]:
df["Age"].dtypes

dtype('int64')

In [97]:
df.dtypes

Name     object
Age       int64
Marks     int64
city     object
dtype: object

In [98]:
type(df)

pandas.core.frame.DataFrame

In [99]:
type(s1)

pandas.core.series.Series

In [100]:
df["Marks"]

0    80
1    98
2    94
Name: Marks, dtype: int64

In [101]:
df["Marks"]+2

0     82
1    100
2     96
Name: Marks, dtype: int64

In [102]:
df["Marks"]-2

0    78
1    96
2    92
Name: Marks, dtype: int64

In [103]:
df["Marks"]*2

0    160
1    196
2    188
Name: Marks, dtype: int64

In [104]:
df["Marks"]/2

0    40.0
1    49.0
2    47.0
Name: Marks, dtype: float64

In [105]:
df["Marks"]%2

0    0
1    0
2    0
Name: Marks, dtype: int64

In [106]:
df

     Name  Age  Marks    city
0   vansh   20     80   surat
1   abhay   18     98  baroda
2  dhruvi   22     94  amreli

In [107]:
df["Marks"]=df["Marks"]+2
df

     Name  Age  Marks    city
0   vansh   20     82   surat
1   abhay   18    100  baroda
2  dhruvi   22     96  amreli

In [108]:
df["Marks"]=df["Marks"]-2
df

     Name  Age  Marks    city
0   vansh   20     80   surat
1   abhay   18     98  baroda
2  dhruvi   22     94  amreli

In [109]:
df["Marks"]=df["Marks"]*2
df

     Name  Age  Marks    city
0   vansh   20    160   surat
1   abhay   18    196  baroda
2  dhruvi   22    188  amreli

In [110]:
df["Marks"]=df["Marks"]/2
df

     Name  Age  Marks    city
0   vansh   20   80.0   surat
1   abhay   18   98.0  baroda
2  dhruvi   22   94.0  amreli

In [111]:
df["Marks"]=df["Marks"]%2
df

     Name  Age  Marks    city
0   vansh   20    0.0   surat
1   abhay   18    0.0  baroda
2  dhruvi   22    0.0  amreli

In [112]:
type(df["Marks"])

pandas.core.series.Series

In [113]:
df2=pd.DataFrame([
    ["aaryan","vansh","dhruvi"],
    [20,22,18],
    [98,78,86]
])
df2

        0      1       2
0  aaryan  vansh  dhruvi
1      20     22      18
2      98     78      86

In [114]:
df3=pd.DataFrame([
    ["aaryan","vansh","dhruvi"],
    [20,22,18],
    [98,78,86]
], index=["Name","Age","Marks"])
df3

            0      1       2
Name   aaryan  vansh  dhruvi
Age        20     22      18
Marks      98     78      86

In [115]:
df3=pd.DataFrame([
    ["aaryan","vansh","dhruvi"],
    [20,22,18],
    [98,78,86]
], columns=["Name","Age","Marks"])
df3

     Name    Age   Marks
0  aaryan  vansh  dhruvi
1      20     22      18
2      98     78      86

In [116]:
type(df3)

pandas.core.frame.DataFrame

In [117]:
type(df3["Name"])

pandas.core.series.Series

In [118]:
# iloc & loc

In [119]:
dd=[["alice",25,"us"],
["bob",34,"america"],
["champ",22,"pune"]]

In [120]:
df2=pd.DataFrame(dd,columns=["Name","Age","city"])
df2

    Name  Age     city
0  alice   25       us
1    bob   34  america
2  champ   22     pune

In [121]:
df2["Name"]

0    alice
1      bob
2    champ
Name: Name, dtype: object

In [122]:
df2.Name

0    alice
1      bob
2    champ
Name: Name, dtype: object

In [123]:
df2.Name[0]

'alice'

In [124]:
df2

    Name  Age     city
0  alice   25       us
1    bob   34  america
2  champ   22     pune

In [125]:
df2.iloc[0]

Name    alice
Age        25
city       us
Name: 0, dtype: object

In [126]:
df2.iloc[0:2]

    Name  Age     city
0  alice   25       us
1    bob   34  america

In [127]:
df2.iloc[0::2]

    Name  Age  city
0  alice   25    us
2  champ   22  pune

In [128]:
df2.iloc[0:2,0:2]

    Name  Age
0  alice   25
1    bob   34

In [129]:
df2

    Name  Age     city
0  alice   25       us
1    bob   34  america
2  champ   22     pune

In [130]:
df2.loc[0]

Name    alice
Age        25
city       us
Name: 0, dtype: object

In [131]:
# how to set index from existing column.

In [132]:
df3=df2.set_index("Name")

In [133]:
df3

       Age     city
Name
alice   25       us
bob     34  america
champ   22     pune

In [134]:
df3.loc["bob"]

Age          34
city    america
Name: bob, dtype: object

In [135]:
df3.loc[["alice","champ"]]

       Age  city
Name
alice   25    us
champ   22  pune

In [138]:
df3.loc["alice":"bob"]

       Age     city
Name
alice   25       us
bob     34  america

In [139]:
df3.loc[df3["city"]!="us"]

       Age     city
Name
bob     34  america
champ   22     pune